{
    "nfr": {
        "add_Nfr": "Click here to add a new Customer RFQ.",
        "fetch": "Click this button to fetch the latest data from SAP.",
        "search": "Search for specific data from here.",
        "refresh": "Refresh the grid to update filtered data from here.",
        "viewNPart": "Click here to view the Customer RFQ Part listing.",
        "DeleteNfr": "Click here to delete the Customer RFQ.",
        "nfrSummary": "Click on the Customer RFQ number to view the summary from here.",
        "view": "View detailed Customer RFQ from here.",
        "edit": "Click here to edit the Customer RFQ.",
        "viewRm": "View the Raw Material listing from here.",
        "associatePartWithTechnology": "Click here to associate the part with technology.",
        "pushedNfrToSap": "Click here to push the cost to SAP.",
        "back": "Click here to go back to the Customer RFQ List.",
        "back_nfrpart": "Click here to go back to the Customer RFQ Part List.",
        "add": "Click here to add a new Customer RFQ.",
        "viewOutSourcing": "View the Outsourcing list from here.",
        "groupName": "Enter your Group Name.",
        "vendor": "Select a Vendor from the dropdown.",
        "reset": "Click here to reset the form.",
        "add_Estimation": "Click here to add New Estimation.",
        "update_Estimation": "Click here to update Estimation.",
        "reset_Estimation": "Click here to reset Details.",
        "cancel_Estimation": "Click here to cancel Update details.",
        "cancel": "Click here to cancel.",
        "save": "Click here to save the Customer RFQ.",
        "sendForApproval": "Click here to send the Customer RFQ for approval.",
        "costingVersion": "Here you can see all the versions of created costings.",
        "addCosting": "Select the costing version from the dropdown, after you can add the costing from here.",
        "editCosting": "Select the costing version from the dropdown, after you can edit the costing from here.",
        "viewCosting": "Select the costing version from the dropdown, after you can view the costing from here.",
        "deleteCosting": "Select the costing version from the dropdown, after you can delete the costing from here.",
        "copyCosting": "Select the costing version from the dropdown, after you can copy the costing from here.",
        "discardCosting": "Remove the added row from here.",
        "nfr_RowEdit": "Click here to update the vendor.",
        "floatingFilterInput": "Here you can search for specific column-wise data.",
        "floatingFilterButton": "Here you can filter the data based on different conditions."
    },
    "addNfr": {
        "customer_rfq_no": "Enter the unique RFQ number provided by the customer.",
        "customer_name": "Click here to select the customer's name from the dropdown.",
        "customer_part_no": "Click here to select the customer's part number from the dropdown.",
        "part_name": "Displays the part name. This field is auto-filled.",
        "part_description": "Displays the description of the part. This field is auto-filled.",
        "uom": "Displays the uom of the part. This field is auto-filled.",
        "product_code": "Click here to select the product code from the dropdown.",
        "segment": "Click here to select the customer or product segment from the dropdown.",
        "plant": "Click here to select the plant location from the dropdown.",
        "zbc_date": "Select the ZBC submission date for this RFQ.",
        "cbc_date": "Select the CBC submission date for this RFQ.",
        "sop_date": "Select the Start of Production (SOP) date for the part.",
        "add_forecast": "Click here to add forecast details for this RFQ.",
        "addRFQ_uploadFile": "Upload relevant RFQ documents. You can upload up to 4 files.",
        "cancel": "Click here to cancel the NFR.",
        "add": "Click here to add a new NFR.",
        "submit": "Click here to submit the NFR."
    }
}