{
    "RFQForm": {
        "Technology": "Click here to select the technology from the dropdown.",
        "RFQNo": "Click here to select the RFQ number from the dropdown.",
        "PlantCode": "Click here to select the plant code from the dropdown.",
        "PartNo": "Click here to select the part number from the dropdown.",
        "SubmissionDate": "Click here to save the submission date.",
        "Edit_Rfq_SubmissionDate": "Click here to edit the submission date.",
        "SOPDate": "Click here to enter the SOP date.",
        "RMName": "Click here to select the raw material name from the dropdown.",
        "RMGrade": "Click here to select the raw material grade from the dropdown.",
        "RMSpecification": "Click here to select the raw material specification from the dropdown.",
        "AddPart": "Click here to add the part.",
        "Reset": "Click here to reset the part details.",
        "VendorCode": "Click here to select the vendor code from the dropdown.",
        "PointofContact": "Click here to select whom you want to contact from the dropdown.",
        "AddVendor": "Click here to add the vendor.",
        "ResetVendor": "Click here to reset the vendor details.",
        "VisibilityCheckbox": "Check the box to select visibility mode.",
        "VisibilityMode": "Click here to select the preferred visibility mode.",
        "Notes": "Click here to enter any additional notes here.",
        "UploadAttachment": "Attach any necessary documents.",
        "save": "Click here to save the data. Note that the quotation will not be sent to the vendor.",
        "cancel": "Click here to return to the RFQ page.",
        "send": "Click here to send the quotation to the vendor."
    },
    "rfqView": {
        "ViewRfq": "Click on the checkbox to compare the RFQs.",
        "ViewRfq_reset": "Click here to refresh the grid to update filtered data from here.",
        "ViewRfq_compare": "Click on the checkbox of the part number to compare the RFQs.",
        "ViewRfq_back": "Click here to return to the RFQ listing.",
        "ViewRfq_remarkHistory": "Click here to view the remark history.",
        "ViewRfq_view": "Click here to view the costing details."
    }
}